<?php

	$object = array();
	$object['m'] = array();
	$object['l'] = array(100,126,152,178,204,230,256,282,308,334,360,386,412,438,464,490,516,542,568,594,620,646,672,698,724,750,776,802,828,854,880,906,932,958,984,1010,1036,1062,1088,1114,1140,1166,1192,1218,1244,1270,1296,1322,1348,1374,1400,1426,1452,1478,1504,1530,1556,1582,1608,1634,1660,1686,1712,1738,1764,1790,1816,1842,1868,1894,1920,1946,1972,1998,2024,2050,2076,2102,2128,2154,2180,2206,2232,2258,2284,2310,2336,2362,2388,2414,2440,2466,2492,2518,2544,2570,2596,2622,2648,2674,2700,2726,2752,2778,2804,2830,2856,2882,2908,2934,2960,2986,3012,3038,3064,3090,3116,3142,3168,3194,3220,3246,3272,3298,3324,3350,3376,3402,3428,3454,3480,3506,3532,3558,3584,3610,3636,3662,3688,3714,3740,3766,3792,3818,3844,3870,3896,3922,3948,3974,4000,4026,4052,4078,4104,4130,4156,4182,4208,4234,4260,4286,4312,4338,4364,4390,4416,4442,4468,4494,4520,4546,4572,4598,4624,4650,4676,4702,4728,4754,4780,4806,4832,4858,4884,4910,4936,4962,4988,5014,5040,5066,5092,5118,5144,5170,5196,5222,5248,5274,5300,5326,5352,5378,5404,5430,5456,5482,5508,5534,5560,5586,5612,5638,5664,5690,5716,5742,5768,5794,5820,5846,5872,5898,5924,5950,5976,6002,6028,6054,6080,6106,6132,6158,6184,6200,6200);

	newObj(50, 'emax', 2, 'Грузчик', 'увеличивает максиманую энергию на 2 ед.', 0, 0);
	newObj(20, 'mandat_dmg_bonus', array(5,0,0,0,0,0), 'Строитель', 'увеличивает урон от кирпича на 5 ед.', 5, 50);
	newObj(20, 'mandat_dmg_bonus', array(0,0,5,0,0,0), 'Боксёр', 'увеличивает урон от руки на 5 ед.', 0, 50);
	newObj(20, 'mandat_dmg_bonus', array(0,5,0,0,0,0), 'Футболист', 'увеличивает урон от ноги на 5 ед.', 0, 50);
	newObj(50, 'mandat_dmg_bonus', array(0,0,0,5,0,0), 'Вышибала', 'увеличивает урон от биты на 5 ед.', 0, 70);
	newObj(50, 'mandat_dmg_bonus', array(0,0,0,0,5,0), 'Охранник', 'увеличивает урон от травмата на 5 ед.', 0, 70);
	newObj(50, 'mandat_dmg_bonus', array(0,0,0,0,0,5), 'Бармен', 'увеличивает урон от розочки на 5 ед.', 0, 70);
	newObj(50, 'mandat_dmg_bonus', array(0,0,0,0,0,0,5), 'Менеджер', 'увеличивает урон от ножа на 5 ед.', 1, 260);

    
    echo json_encode($object);
    
    function newObj($lvls, $field, $plus, $name, $info, $block, $open){
        global $object;

        $myArr['lvls'] = $lvls;
        $myArr['fld'] = $field;
        $myArr['pls'] = $plus;
        $myArr['name'] = base64_encode($name);
        $myArr['info'] = base64_encode($info);
        $myArr['block'] = $block;
        $myArr['open'] = $open;

        array_push($object['m'], $myArr);
    }

?>